# GetEndConstraint Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarUpdateCurvesData..::..GetEndConstraint Method
RebarUpdateCurvesData Class See Also
---
Gets the current constraint for the end handle of the Rebar.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public RebarConstraint GetEndConstraint()
```

Visual Basic
---
```text
Public Function GetEndConstraint As RebarConstraint
```

Visual C++
---
```text
public:
RebarConstraint^ GetEndConstraint()
```

# ### Return Value
Returns the current constraint for the end handle of the Rebar. Return value is null is no constraint is present.
# See Also
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace